src/Catalogs/Проекты/Проекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Проекты</name>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Завершен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПартнерыИКонтактныеЛица</name>
    <attributes>
      <name>Партнер</name>
      <type>
        <types>CatalogRef.Партнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>РольПартнера</name>
      <type>
        <types>CatalogRef.РолиПартнеровВСделкахИПроектах</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтактноеЛицо</name>
      <type>
        <types>CatalogRef.КонтактныеЛицаПартнеров</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/Проекты/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Завершен = Ложь;
	ПлановаяДатаНачала = ТекущаяДатаСеанса();
	ПлановаяДатаОкончания = Дата(1,1,1);
	ДатаНачала = ТекущаяДатаСеанса();
	ПлановаяДатаОкончания = Дата(1,1,1);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Взаимодействия.УстановитьПризнакАктивен(Ссылка, (НЕ Завершен) И (Не ПометкаУдаления));
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЗначениеЗаполнено(ПлановаяДатаОкончания)
		И ПлановаяДатаНачала > ПлановаяДатаОкончания Тогда
		
		ТекстСообщения = НСтр("ru = 'Плановая дата окончания не должна быть меньше плановой даты начала.';
								|en = 'Planned end date cannot be less than planned start date.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,
		                                                  ЭтотОбъект,
		                                                  "ПлановаяДатаОкончания",
		                                                  ,
		                                                  Отказ);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДатаОкончания)
		И ДатаНачала > ДатаОкончания Тогда
		
		ТекстСообщения = НСтр("ru = 'Дата окончания не должна быть меньше даты начала.';
								|en = 'End date cannot be earlier than the start date.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,
		                                                  ЭтотОбъект,
		                                                  "ДатаОкончания",
		                                                  ,
		                                                  Отказ);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
